export interface WilayaCoords {
    [key: number]: [number, number];
}

export const WILAYA_COORDS: WilayaCoords = {
    1: [27.882, -0.284], // Adrar
    2: [36.165, 1.332], // Chlef
    3: [33.803, 2.879], // Laghouat
    4: [35.867, 7.113], // Oum El Bouaghi
    5: [35.556, 6.174], // Batna
    6: [36.751, 5.056], // Béjaïa
    7: [34.850, 5.728], // Biskra
    8: [31.621, -2.215], // Béchar
    9: [36.470, 2.827], // Blida
    10: [36.374, 3.896], // Bouira
    11: [22.785, 5.523], // Tamanrasset
    12: [35.408, 8.124], // Tébessa
    13: [34.879, -1.315], // Tlemcen
    14: [35.371, 1.317], // Tiaret
    15: [36.712, 4.045], // Tizi Ouzou
    16: [36.753, 3.058], // Alger
    17: [34.673, 3.250], // Djelfa
    18: [36.811, 5.766], // Jijel
    19: [36.191, 5.409], // Sétif
    20: [34.842, 0.145], // Saïda
    21: [36.879, 6.906], // Skikda
    22: [35.190, -0.628], // Sidi Bel Abbès
    23: [36.900, 7.767], // Annaba
    24: [36.462, 7.426], // Guelma
    25: [36.365, 6.614], // Constantine
    26: [36.270, 2.754], // Médéa
    27: [35.933, 0.089], // Mostaganem
    28: [35.704, 4.542], // M'Sila
    29: [35.397, 0.140], // Mascara
    30: [31.949, 5.325], // Ouargla
    31: [35.698, -0.634], // Oran
    32: [33.680, 1.019], // El Bayadh
    33: [26.483, 8.467], // Illizi
    34: [36.073, 4.761], // Bordj Bou Arréridj
    35: [36.760, 3.473], // Boumerdès
    36: [36.767, 8.314], // El Tarf
    37: [27.671, -8.138], // Tindouf
    38: [35.607, 1.810], // Tissemsilt
    39: [33.368, 6.867], // El Oued
    40: [35.435, 7.143], // Khenchela
    41: [36.287, 7.951], // Souk Ahras
    42: [36.589, 2.447], // Tipaza
    43: [36.450, 6.262], // Mila
    44: [36.263, 2.222], // Aïn Defla
    45: [33.267, -0.317], // Naâma
    46: [35.307, -1.140], // Aïn Témouchent
    47: [32.491, 3.673], // Ghardaïa
    48: [35.741, 0.552], // Relizane
    49: [33.996, 5.922], // El M'Ghair
    50: [33.106, 6.068], // Touggourt
    51: [24.553, 9.485], // Djanet
    52: [27.245, 2.483], // Aïn Salah
    53: [19.671, 5.766], // Aïn Guezzam
    54: [29.263, 0.231], // Timimoun
    55: [21.328, 0.954], // Bordj Badji Mokhtar
    56: [34.331, 5.061], // Ouled Djellal
    57: [30.133, -2.167], // Béni Abbès
    58: [27.193, 2.487], // In Salah
};
